# KA Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KA Property
SymbolTypeId Class See Also
---
Symbol kA, indicating unit Kiloamperes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KA { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KA As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KA {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace